# SQL (T-SQL) Practical Task Exercises â€“ Arteom Kalamaghin

## 175. Combine Two Tables

In [ ]:
SELECT
    p.firstName,
    p.lastName,
    a.city,
    a.state
FROM Person AS p
LEFT JOIN Address AS a
    ON p.personId = a.personId;

## 176. Second Highest Salary

In [ ]:
WITH RankedSalaries AS (
    SELECT DISTINCT salary
    FROM Employee
)
SELECT
    MAX(salary) AS SecondHighestSalary
FROM (
    SELECT salary
    FROM RankedSalaries
    ORDER BY salary DESC
    OFFSET 1 ROWS
    FETCH NEXT 1 ROWS ONLY
) AS SecondSalary;

## 177. Nth Highest Salary

In [ ]:
CREATE FUNCTION getNthHighestSalary(@N INT)
RETURNS INT
AS
BEGIN
    DECLARE @result INT;

    IF @N <= 0
        RETURN NULL;

    WITH RankedSalaries AS (
        SELECT DISTINCT salary
        FROM Employee
    )
    SELECT @result = MAX(salary)
    FROM (
        SELECT salary
        FROM RankedSalaries
        ORDER BY salary DESC
        OFFSET @N-1 ROWS
        FETCH NEXT 1 ROWS ONLY
    ) AS SecondSalary;

    RETURN @result;
END;

## 178. Rank Scores

In [ ]:
SELECT
    score,
    DENSE_RANK() OVER (ORDER BY score DESC) AS rank
FROM scores;

## 180. Consecutive Numbers

In [ ]:
SELECT
    DISTINCT l1.num AS ConsecutiveNums
FROM Logs AS l1a
LEFT JOIN Logs AS l2
    ON l2.id = l1.id + 1
LEFT JOIN Logs AS l3
    ON l3.id = l1.id + 2
WHERE l1.num = l2.num AND l2.num = l3.num;

## 181. Employees Earning More Than Their Managers

In [ ]:
SELECT
    e1.name AS Employee
FROM Employee AS e1
LEFT JOIN Employee AS e2
    ON e1.managerId = e2.id
WHERE e1.salary;

## 182. Duplicate Emails

In [ ]:
SELECT
    email AS Email
FROM Person
GROUP BY email
HAVING COUNT(*) > 1;

## 183. Customers Who Never Order

In [ ]:
SELECT
    c.name AS Customers
FROM Customers as c
LEFT JOIN Orders AS o
	ON c.id = o.customerId
WHERE o.id IS NULL;

## 184. Department Highest Salary

In [ ]:
SELECT
    Department,
    Employee,
    Salary
FROM (
    SELECT d.name AS Department,
        e.name AS Employee,
        e.salary,
        RANK() OVER (PARTITION BY e.departmentId ORDER BY e.salary DESC) AS rnk
    FROM employee AS e
    LEFT JOIN department AS d
        ON e.departmentId = d.id
) AS t
WHERE rnk = 1;

## 626. Exchange Seats

In [ ]:
SELECT 
    s1.id,
    CASE 
        WHEN s1.id % 2 = 1 AND EXISTS (SELECT 1 FROM Seat s2 WHERE s2.id = s1.id + 1)
            THEN (SELECT student FROM Seat s2 WHERE s2.id = s1.id + 1)
        WHEN s1.id % 2 = 0 
            THEN (SELECT student FROM Seat s2 WHERE s2.id = s1.id - 1)
        ELSE student
    END AS student
FROM Seat s1
ORDER BY id;

## 627. Swap Salary

In [ ]:
UPDATE Salary
SET sex = CASE
        WHEN sex = 'm' THEN 'f'
        ELSE 'm'
    END;